OpenFOAM/simpleFsi-OFv2112/cases/main-les-long-SBRS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        maxIter         20;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0.01;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            cacheAgglomeration no;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-5;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    "(pcorr.*)"
    {
        solver          PCG;
        tolerance       1e-03;
        relTol          1e-02;
        maxIter         20;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0.01;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            cacheAgglomeration no;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }
    
    "(k|omega|kFinal|omegaFinal)"
    {
	$UFinal;
    }

    "(cellDisplacement.*)"
    {
        solver          PCG;
        tolerance       1e-06;
        relTol          1e-06;
        maxIter         20;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0.01;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            cacheAgglomeration no;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
    }
}

PIMPLE
{
    correctPhi          true;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
}


// ************************************************************************* //
